run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ_LES/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  HeliumConstRho;
HeliumConstCoeffs
{
	// Mean helium density
	//rhoHe             rhoHe    [1 -3 0 0 0 0 0]  147.0;
	TMean            [0 0 0 1 0 0 0] 1.675;
}
HeliumConstRhoCoeffs
{
	// Mean helium density
//	rhoHe             rhoHe    [1 -3 0 0 0 0 0]  147.0;
}
superFluidWallCoeffs
{
	// Mean helium density
//	rhoHe             rhoHe    [1 -3 0 0 0 0 0]  147.0;
}

//rho             147.0; // for turbulentWallHeatFluxTemperature

simplifiedSuperFluid  Pietrowicz;
KitamuraCoeffs
{
}
PietrowiczCoeffs
{
	GM		off;
}

// hel w temp. 1.95 K
//nu              [0 2 -1 0 0 0 0] 0.00000000984449; 


// Needed for turbulentHeatFluxTemperature BC
//rhoCp0           667642.820509542; // [1 -1 -2 -1 0 0 0]

// Laminar Prandtl number
//Pr              [0 0 0 0 0 0 0] 1;// solver crashes if it is 0

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.7;

// Thermal expansion coefficient
//beta            [0 0 0 -1 0 0 0] -0.005283;  // hel w temp. 1.8 K

// Reference temperature
TRef            [0 0 0 1 0 0 0] 1.95;

// parametr Goerter-Mellink dla helu w 1.95 K
//AGM             [-1 1 1 0 0 0 0] 1172.3688458133;    

// entropia dla helu w 1.95 K
//s               [0 2 -2 -1 0 0 0] 842.4003528199;    

// cp dla helu w 1.95 K
//cp              [0 2 -2 -1 0 0 0] 4528.9717746579;   

// rho dla helu w 1.95 K
//rho             [1 -3 0 0 0 0 0] 147.4159817567;     

// 1/f dla helu w 1.95 K
//onebyf          [3 1 -9 -1 0 0 0] 16975710249321.5;  

// temperatura lambda dla helu w 1.95 K
//Tlambda          [0 0 0 1 0 0 0] 2.1711132461;       

// ************************************************************************* //
